Repository: vyndrix/vyndrix.me
Catalog: src/i18n/locales/*/messages.po
Languages: pt_br

source: A frontend and mobile developer focused on growing as a specialist in modern interfaces and design-driven experiences. Drawn to clean architecture, smooth interactions, and the small details that shape how things feel. Long-time comics collector, art enthusiast, and permanently supervised by two cats
pt_br: Desenvolvedor frontend e mobile com foco em evoluir como especialista em interfaces modernas e experiências guiadas por design. Atraído por arquiteturas limpas, interações suaves e pelos pequenos detalhes que definem como as coisas são percebidas. Colecionador de quadrinhos há muitos anos, entusiasta de arte e permanentemente supervisionado por dois gatos.

source: Acted as a team lead for around two years, supporting engineers through code reviews, technical discussions, and day-to-day decision making. Focused on maintaining code quality, encouraging good engineering practices, and helping teammates grow while keeping the team aligned and productive.
pt_br: Atuei como líder de equipe por cerca de dois anos, apoiando engenheiros por meio de revisões de código, discussões técnicas e decisões do dia a dia. Foco em manter a qualidade do código, incentivar boas práticas de engenharia e ajudar o time a evoluir de forma alinhada e produtiva.

source: Building strong working relationships across disciplines.
pt_br: Construindo relações de trabalho sólidas entre diferentes áreas.

source: Collaboration & Agile Delivery
pt_br: Colaboração e Entrega Ágil

source: Comfortable working closely with people from different roles, especially designers and product stakeholders, to turn ideas into well-crafted interfaces. Often involved in supporting teammates through discussions, feedback, and shared problem-solving, aiming to keep collaboration healthy, transparent, and productive.
pt_br: Confortável em trabalhar de perto com pessoas de diferentes áreas, especialmente designers e stakeholders de produto, transformando ideias em interfaces bem construídas. Frequentemente envolvido em apoiar colegas por meio de discussões, feedbacks e resolução conjunta de problemas, mantendo a colaboração saudável, transparente e produtiva.

source: Communication & Team Support
pt_br: Comunicação e Suporte ao Time

source: Core Skills
pt_br: Competências Principais

source: Experience building component-driven web interfaces with React, focusing on composition, accessibility, and interaction quality. My background in mobile development strongly influences how I structure and design UI on the web.
pt_br: Experiência na construção de interfaces web baseadas em componentes com React, com foco em composição, acessibilidade e qualidade de interação. Minha experiência em desenvolvimento mobile influencia fortemente a forma como estruturo e desenho interfaces na web.

source: Extensive experience using Expo to streamline mobile development workflows, from local tooling to production delivery. Familiar with build pipelines, release processes, and leveraging Expo’s ecosystem to improve developer productivity.
pt_br: Experiência sólida com Expo para otimizar fluxos de desenvolvimento mobile, desde ferramentas locais até entrega em produção. Familiaridade com pipelines de build, processos de release e uso do ecossistema do Expo para aumentar a produtividade.

source: Forms (react-hook-form)
pt_br: Formulários (react-hook-form)

source: Functional patterns
pt_br: Padrões funcionais

source: Hands-on experience working in Scrum-based environments, contributing to planning, reviews, and retrospectives. Used to breaking down work into meaningful increments, aligning with product goals, and collaborating closely with designers, QA, and backend engineers to keep delivery predictable and focused.
pt_br: Experiência prática em ambientes baseados em Scrum, contribuindo com planejamento, reviews e retrospectivas. Habituado a dividir o trabalho em incrementos significativos, alinhados aos objetivos do produto, colaborando de perto com designers, QA e engenheiros backend para manter entregas previsíveis e focadas.

source: Hi, I'm Vyndrix
pt_br: Oi, eu sou o Vyndrix

source: Leading by example, clarity, and technical ownership.
pt_br: Liderança baseada em exemplo, clareza e responsabilidade técnica.

source: My primary platform for the past few years, focused on building and maintaining production mobile applications. Experienced with component architecture, performance considerations, animations, and platform-specific constraints, with an emphasis on clean, scalable codebases.
pt_br: Minha principal plataforma nos últimos anos, com foco no desenvolvimento e manutenção de aplicações mobile em produção. Experiência com arquitetura de componentes, performance, animações e limitações específicas de cada plataforma, sempre priorizando bases de código limpas e escaláveis.

source: Native APIs
pt_br: APIs nativas

source: Performance optimization
pt_br: Otimização de performance

source: Related skills
pt_br: Competências relacionadas

source: State management (Zustand / Jotai)
pt_br: Gerenciamento de estado (Zustand / Jotai)

source: Strong command of modern JavaScript, developed through optimizing React and React Native applications. Comfortable with ES6+ features, asynchronous flows, and writing predictable, maintainable logic for complex interfaces.
pt_br: Domínio sólido de JavaScript moderno, desenvolvido ao otimizar aplicações React e React Native. Confortável com recursos ES6+, fluxos assíncronos e escrita de lógica previsível e de fácil manutenção para interfaces complexas.

source: Technical Leadership & Mentorship
pt_br: Liderança Técnica e Mentoria

source: Ways of Working
pt_br: Formas de Trabalho

source: Working in rhythm with teams to ship iteratively and consistently.
pt_br: Trabalhando em sintonia com o time para entregar de forma iterativa e consistente.
